[
    {
        "day": "Даваа",
        "time": "08:00-09:30",
        "subject": "Вебийн үндэс (Лекц)",
        "room": "205",
        "teacher": "Н.Ринчмаа"
    },
    {
        "day": "Даваа",
        "time": "09:40-11:10",
        "subject": "Англи хэл I",
        "room": "301",
        "teacher": "Б.Алтантүлхүүр"
    },
    {
        "day": "Даваа",
        "time": "11:20-12:50",
        "subject": "Вебийн үндэс (Лаб)",
        "room": "303",
        "teacher": "Н.Ринчмаа"
    },
    {
        "day": "Даваа",
        "time": "13:20-14:50",
        "subject": "Мэргэжлийн удиртгал (Лаб)",
        "room": "302",
        "teacher": "Ө.Ганзориг"
    },
    {
        "day": "Мягмар",
        "time": "08:00-09:30",
        "subject": "Биеийн тамир",
        "room": "-",
        "teacher": "-"
    },
    {
        "day": "Мягмар",
        "time": "11:20-12:50",
        "subject": "Мэргэжлийн удиртгал (Лаб)",
        "room": "302",
        "teacher": "Ө.Ганзориг"
    },
    {
        "day": "Мягмар",
        "time": "13:20-14:50",
        "subject": "Алгоритмын үндэс (Лекц)",
        "room": "205",
        "teacher": "Х.Сувд-Эрдэнэ"
    },
    {
        "day": "Лхагва",
        "time": "11:20-12:50",
        "subject": "Математик I (Лекц)",
        "room": "205",
        "teacher": "Б.Цэнд-Аюуш"
    },
    {
        "day": "Лхагва",
        "time": "13:20-14:50",
        "subject": "Математик I (Сем)",
        "room": "304",
        "teacher": "Б.Цэнд-Аюуш"
    },
    {
        "day": "Пүрэв",
        "time": "08:00-09:30",
        "subject": "Математик I (Сем)",
        "room": "304",
        "teacher": "Б.Цэнд-Аюуш"
    },
    {
        "day": "Пүрэв",
        "time": "09:40-11:10",
        "subject": "Компьютерын хэрэглээ (Лекц)",
        "room": "205",
        "teacher": "Х.Сувд-Эрдэнэ"
    },
    {
        "day": "Баасан",
        "time": "13:20-14:50",
        "subject": "Алгоритмын үндэс (Лаб)",
        "room": "302",
        "teacher": "Х.Сувд-Эрдэнэ"
    },
    {
        "day": "Баасан",
        "time": "15:00-16:30",
        "subject": "Компьютерын хэрэглээ (Лаб)",
        "room": "302",
        "teacher": "Х.Сувд-Эрдэнэ"
    }
]


schedule_data = [
    {"day": "Даваа", "time": "08:00-09:30",
        "subject": "Вебийн үндэс (Лекц)", "room": "205", "teacher": "Н.Ринчмаа"},
    {"day": "Даваа", "time": "09:40-11:10", "subject": "Англи хэл I",
        "room": "301", "teacher": "Б.Алтантүлхүүр"},
    {"day": "Даваа", "time": "11:20-12:50",
        "subject": "Вебийн үндэс (Лаб)", "room": "303", "teacher": "Н.Ринчмаа"},
    {"day": "Даваа", "time": "13:20-14:50",
        "subject": "Мэргэжлийн удиртгал (Лаб)", "room": "302", "teacher": "Ө.Ганзориг"},
    {"day": "Мягмар", "time": "08:00-09:30",
        "subject": "Биеийн тамир", "room": "-", "teacher": "-"},
    {"day": "Мягмар", "time": "11:20-12:50",
        "subject": "Мэргэжлийн удиртгал (Лаб)", "room": "302", "teacher": "Ө.Ганзориг"},
    {"day": "Мягмар", "time": "13:20-14:50",
        "subject": "Алгоритмын үндэс (Лекц)", "room": "205", "teacher": "Х.Сувд-Эрдэнэ"},
    {"day": "Лхагва", "time": "11:20-12:50",
        "subject": "Математик I (Лекц)", "room": "205", "teacher": "Б.Цэнд-Аюуш"},
    {"day": "Лхагва", "time": "13:20-14:50",
        "subject": "Математик I (Сем)", "room": "304", "teacher": "Б.Цэнд-Аюуш"},
    {"day": "Пүрэв", "time": "08:00-09:30",
        "subject": "Математик I (Сем)", "room": "304", "teacher": "Б.Цэнд-Аюуш"},
    {"day": "Пүрэв", "time": "09:40-11:10",
        "subject": "Компьютерын хэрэглээ (Лекц)", "room": "205", "teacher": "Х.Сувд-Эрдэнэ"},
    {"day": "Баасан", "time": "13:20-14:50",
        "subject": "Алгоритмын үндэс (Лаб)", "room": "302", "teacher": "Х.Сувд-Эрдэнэ"},
    {"day": "Баасан", "time": "15:00-16:30",
        "subject": "Компьютерын хэрэглээ (Лаб)", "room": "302", "teacher": "Х.Сувд-Эрдэнэ"},
]
